<template>
  <div class="custom-container flex w-full flex-col items-start pb-[120px]">
    <p class="main--section--title">История</p>
    <div class="flex gap-[20px]">
      <div class="flex w-1/2">
        Волжский берег у Молочной горы, поднимающейся к главной Екатеринославской площади города было
        всегда многолюдно. У обелисков Московской заставы — парадного въезда города, построенной
        по проекту архитектора Петра Фурсова, кипит торговая жизнь. Пристают суда, оформляют товар
        и платят пошлины, весь берег заставлен брёвнами, складами с разным товаром, лодками.
        <br />
        <br />

        Здесь же переправа через Волгу. Жители заволжских деревень и сел, везут товар на продажу,
        тут же на горе торгуют молочным товаром (потому гора и Молочная). Рядом расположились
        множество лавок и заведений с дешёвой едой, тут же казённый питейный дом, пивная, чайная
        общества трезвости «Колпаки», где водку могут подать прямо в чайнике.
        <br />
        <br />
        Именно здесь можно было встретить самых колоритных персонажей. В Нижнем Новгороде их называли
        босяками, в Москве — хитровцами, в Самаре — горчичниками, а в Ярославле и Костроме -
        «зимогоры». Но везде за этими жителями городских низов закрепилось насмешливое прозвание
        «золотая рота».
        <br />
        <br />
      </div>
      <div class="flex w-1/2">
        Леонид Колгушкин, оставивший подробные воспоминания о Костроме, ярко описал этот типаж. «Зимогор почти не
        нищенствовал и редко замечался в кражах. По летам он работал грузчиком на пристанях или на вокзале, переносил
        различные тяжести гражданам с базара, выполнял различные поручения торговцев. Зимой же занимался колкой дров,
        расчисткой снега… Зимогора всегда можно было узнать по небритому лицу, фартуку из грубой мешковины, зимой по
        лаптям, а летом по грязным, босым ногам». Летом они ночевали тут же на берегу, а зимой им приходилось не сладко,
        возможно отсюда и их прозвание – «зимой горевать».
        <br>
        <br>
        Для помощи таким горожанам на средства костромского Федора Чернова в 1890 году было построен ночлежный дом,
        который мог принять на ночлег 250 человек. Этот двухэтажный краснокирпичный дом и сегодня стоит в 150 метрах от
        Московской заставы. На его стене сохранилась табличка: «Сей ночлежный дом построен костромским купцом Федором
        Ивановичем Черновым на свой капитал для нуждающихся в бесплатном ночлеге, без различия всякого сословия, обоего
        полу и передан на вечные времена в костромское городское общество»
      </div>
    </div>
  </div>
</template>

<script setup>
</script>

<style scoped></style>
