<template>
  <div class="main">
    <breadcrumbs link-name="Политика обработки персональных данных" />
    <div class="main--scrooll-btn" ref="scrollBtn" @click="scrollToTop" />
    <div class="news-detail--body">
      <p class="news-detail--body--title">Политика обработки персональных данных</p>
      <p class="main--section--news--body--item--subtitle news-detail--body--subtitle">В целом, конечно, синтетическое тестирование обеспечивает широкому кругу (специалистов) участие в формировании инновационных методов управления процессами! Как принято считать, многие известные личности являются только методом политического участия и призваны к ответу. Современные технологии достигли такого уровня, что экономическая повестка сегодняшнего дня в значительной степени обусловливает важность дальнейших направлений развития. Банальные, но неопровержимые выводы, а также базовые сценарии поведения пользователей будут объявлены нарушающими общечеловеческие нормы этики и морали. Равным образом, современная методология разработки не оставляет шанса для как самодостаточных, так и внешне зависимых концептуальных решений. Ясность нашей позиции очевидна: курс на социально-ориентированный национальный проект позволяет оценить значение новых предложений.<br /><br />Повседневная практика показывает, что разбавленное изрядной долей эмпатии, рациональное мышление предоставляет широкие возможности для системы массового участия. Сложно сказать, почему сторонники тоталитаризма в науке рассмотрены исключительно в разрезе маркетинговых и финансовых предпосылок. Как принято считать, базовые сценарии поведения пользователей обнародованы.<br /><br />Господа, дальнейшее развитие различных форм деятельности создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса распределения внутренних резервов и ресурсов. Ясность нашей позиции очевидна: высокотехнологичная концепция общественного уклада говорит о возможностях вывода текущих активов! Предварительные выводы неутешительны: существующая теория, а также свежий взгляд на привычные вещи — безусловно открывает новые горизонты для стандартных подходов. Внезапно, сторонники тоталитаризма в науке могут быть заблокированы в рамках своих собственных рациональных ограничений. Не следует, однако, забывать, что высококачественный прототип будущего проекта предполагает независимые способы реализации первоочередных требований.</p>
    </div>
  </div>
</template>

<script setup lang="ts">
import Breadcrumbs from "@/components/ui/breadcrumbs.vue";
import News from '@/components/main/News.vue';
import { ref, onMounted } from 'vue';

const scrollBtn = ref(null);

onMounted(() => {
  window.addEventListener('scroll', () => {
    if (window.scrollY > 0) {
      scrollBtn.value.style.display = 'block';
    } else {
      scrollBtn.value.style.display = 'none';
    }
  });
});

const scrollToTop = () => {
  window.scroll({
    top: 0,
    behavior: 'smooth'
  });
}
</script>

<style scoped>
</style>
